app/controllers/api/v1/comments_controller.rb

    def index
        @comments = Comment.where(location_id: params[:location_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."location_id" = $1  [["location_id", 3]]

    def create
        @comment = Comment.new(comment_params)
        @comment.user_id = @current_user.id

        if @comment.save
---
INSERT INTO "comments" ("user_id", "location_id", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["location_id", 2], ["comment", "\"Lugar muito bom e muito divertudo\""], ["created_at", "2021-05-22 19:18:49.209490"], ["updated_at", "2021-05-22 19:18:49.209490"]]

    def find_comment
        @comment = Comment.find_by_id(params[:location_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]