app/controllers/api/v1/locations_controller.rb

  def index
    case params[:type]
      when 'map'
        @request = Location.joins(:user).near([params[:latitude], params[:longitude]], 1000, units: :km)
        @serializer = LocationsSerializer
      when 'list'
        @request = Location.joins(:user).order(name: :asc)
---
SELECT locations.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-7.93762 - locations.latitude) * PI() / 180 / 2), 2) + COS(-7.93762 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-34.827135 - locations.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((locations.longitude - -34.827135) / 57.2957795), ((locations.latitude - -7.93762) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM "locations" INNER JOIN "users" ON "users"."id" = "locations"."user_id" WHERE (locations.latitude BETWEEN -22.410798311084797 AND 6.535558311084796 AND locations.longitude BETWEEN -49.440322189962146 AND -20.21394781003785 AND (3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-7.93762 - locations.latitude) * PI() / 180 / 2), 2) + COS(-7.93762 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-34.827135 - locations.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 1000) ORDER BY distance ASC
SELECT "locations".* FROM "locations" INNER JOIN "users" ON "users"."id" = "locations"."user_id" ORDER BY "locations"."name" ASC

  def create
    @location = Location.new(location_params)
    @location.user_id = @current_user.id

    if @location.save
---
INSERT INTO "locations" ("user_id", "name", "postal_code", "number", "address", "country", "state_code", "latitude", "longitude", "created_at", "updated_at", "city") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    return render json: @location, status: :ok if @location.update(location_params)
---
UPDATE "locations" SET "name" = $1, "latitude" = $2, "longitude" = $3, "updated_at" = $4 WHERE "locations"."id" = $5  [["name", "OUTRO NOME"], ["latitude", -7.874703], ["longitude", -34.832421], ["updated_at", "2021-05-23 03:23:43.219548"], ["id", 1]]

  def find_location
    @location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]