app/controllers/authentication_controller.rb

  def logout
    revoke = ValidateJwtToken.find_or_create_by(token: request.headers['Authorization'])
---
INSERT INTO "validate_jwt_tokens" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-05-23 00:24:54.432893"], ["updated_at", "2021-05-23 00:24:54.432893"]]
SELECT "validate_jwt_tokens".* FROM "validate_jwt_tokens" WHERE "validate_jwt_tokens"."token" IS NULL LIMIT $1  [["LIMIT", 1]]