app/models/location.rb

SELECT AVG(rate) FROM "ratings" WHERE "ratings"."location_id" = $1  [["location_id", 1]]
---
    def score
        Rating.where(location_id: self.id).pluck("AVG(rate)").first

SELECT MIN(rate) FROM "ratings" WHERE "ratings"."location_id" = $1  [["location_id", 1]]
---
    def minimun_rate
        Rating.where(location_id: self.id).pluck("MIN(rate)").first

SELECT MIN(rate) FROM "ratings" WHERE "ratings"."location_id" = $1  [["location_id", 1]]
---
    def maximun_rate
        Rating.where(location_id: self.id).pluck("MAX(rate)").first